/*
Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
*/

int getNumber(string message)
{
    int result = 0;
    while (true)
    {
        Console.Write(message);
        if (int.TryParse(Console.ReadLine(), out result) && (result > 0))
        {
            break;
        }
        else
        {
            Console.WriteLine($"Введено неверное число, повторить ввод");
        }
    }
    return result;
}

void naturalNumber(int number)
{
    if (number == 1)
    {
        Console.Write(number);
    }
    else
    {
    Console.Write($"{number}, ");
    naturalNumber(--number);
    }
}

naturalNumber(getNumber("Введите число: "));
Console.WriteLine();
